In [179]:
# Find out your current working directory
import os
print(os.getcwd())


# Display all of the files found in your current working directory
print(os.listdir(os.getcwd()))

C:\Users\chander\Documents
['.conda', '.ipynb_checkpoints', '.keras', '.RData', '.Rhistory', '.Rprofile', '7.png', 'Andrew NG', 'Book1.xlsx', 'Bsoup.ipynb', 'cc_20170614_033801.reg', 'cc_20170614_033830.reg', 'cc_20170614_034320.reg', 'cc_20170614_034337.reg', 'CHANDER_BHUSHAN_addressProof.pdf', 'CHANDER_BHUSHAN_PanCard.pdf', 'Credit score.ipynb', 'Custom Office Templates', 'deep neural net tips.pdf', 'Dell Downloads', 'desktop.ini', 'enron.pdf', 'GTA San Andreas User Files', 'hackerrank.txt', 'high cmp.xlsx', 'hsbc.pdf', 'jupyter-temp', 'keras-mnist', 'keras-mnist.hdf5', 'Kutools for Excel', 'linear_model.py', 'lstm.txt', 'merge_from_ofoct.jpg (1).pdf', 'merge_from_ofoct.jpg.pdf', 'My Music', 'My Pictures', 'My SAS Files', 'My Tableau Repository', 'My Videos', 'my_python.ipynb', 'NFS Most Wanted', 'Payslip_Apr.Pdf', 'Payslip_May.Pdf', 'Project_Scorecard.egp', 'Python Scripts', 'run_classifier.py', 'samsung', 'sbi.pdf', 'Stocks', 'string1.py', 'Untitled.ipynb', 'untitled.txt', 'Untitled1.ipynb', 'Untitled10.ipynb', 'Untitled11.ipynb', 'Untitled12.ipynb', 'Untitled13.ipynb', 'Untitled14.ipynb', 'Untitled15.ipynb', 'Untitled16.ipynb', 'Untitled17.ipynb', 'Untitled18.ipynb', 'Untitled19.ipynb', 'Untitled2.ipynb', 'Untitled20.ipynb', 'Untitled21.ipynb', 'Untitled22.ipynb', 'Untitled23.ipynb', 'Untitled24.ipynb', 'Untitled25.ipynb', 'Untitled3.ipynb', 'Untitled4.ipynb', 'Untitled5.ipynb', 'Untitled6.ipynb', 'Untitled7.ipynb', 'Untitled8.ipynb', 'Untitled9.ipynb', 'Visual Studio 2017', 'WQ_Pandas.ipynb']

In [183]:
import pandas as pd

In [184]:
data = pd.read_csv("F:/insurance.csv")

In [187]:
data.tail(10)

      age     sex     bmi  children smoker     region      charges
1328   23  female  24.225         2     no  northeast  22395.74424
1329   52    male  38.600         2     no  southwest  10325.20600
1330   57  female  25.740         2     no  southeast  12629.16560
1331   23  female  33.400         0     no  southwest  10795.93733
1332   52  female  44.700         3     no  southwest  11411.68500
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

In [16]:
pd_df = pd.DataFrame(data)

In [17]:
pd_df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [188]:
data.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
charges     float64
dtype: object

In [23]:
data['sex'].head()

0    female
1      male
2      male
3      male
4      male
Name: sex, dtype: object

In [25]:
data['charges'].tail()

1333    10600.5483
1334     2205.9808
1335     1629.8335
1336     2007.9450
1337    29141.3603
Name: charges, dtype: float64

In [191]:
data['sex'][35]

'male'

In [192]:
data.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [196]:
data['smoker'].head()

0    yes
1     no
2     no
3     no
4     no
Name: smoker, dtype: object

In [198]:

data["sex"].head()

0    female
1      male
2      male
3      male
4      male
Name: sex, dtype: object

In [203]:
data2 = data.drop('sex', axis=1)

In [204]:
data2.head()

   age     bmi  children smoker     region      charges
0   19  27.900         0    yes  southwest  16884.92400
1   18  33.770         1     no  southeast   1725.55230
2   28  33.000         3     no  southeast   4449.46200
3   33  22.705         0     no  northwest  21984.47061
4   32  28.880         0     no  northwest   3866.85520

In [209]:
data['charges'] = data['charges']*2

In [210]:
data.head()

   age     sex     bmi  children smoker     region      charges dummy_col
0   19  female  27.900         0    yes  southwest  33769.84800         F
1   18    male  33.770         1     no  southeast   3451.10460         F
2   28    male  33.000         3     no  southeast   8898.92400         F
3   33    male  22.705         0     no  northwest  43968.94122         F
4   32    male  28.880         0     no  northwest   7733.71040         F

In [215]:
smoker_df = data[(data['smoker'] == 'yes')]

smoker_df['smoker'].describe()

count     274
unique      1
top       yes
freq      274
Name: smoker, dtype: object

In [61]:
smoker_df.describe()

              age         bmi    children       charges      dummy_col
count  274.000000  274.000000  274.000000    274.000000     274.000000
mean    38.514599   30.708449    1.113139  32050.231832   64100.463663
std     13.923186    6.318644    1.157066  11541.547176   23083.094351
min     18.000000   17.195000    0.000000  12829.455100   25658.910200
25%     27.000000   26.083750    0.000000  20826.244213   41652.488425
50%     38.000000   30.447500    1.000000  34456.348450   68912.696900
75%     49.000000   35.200000    2.000000  41019.207275   82038.414550
max     64.000000   52.580000    5.000000  63770.428010  127540.856020

In [213]:
double_filter_df = data[(data['smoker'] == 'yes') & (data['region']=='southwest')]
double_filter_df.describe()

             age        bmi   children        charges
count  58.000000  58.000000  58.000000      58.000000
mean   36.103448  31.005172   1.206897   64538.126987
std    13.739033   5.420831   1.280880   22540.559185
min    19.000000  18.300000   0.000000   27689.012000
25%    25.000000  27.625000   0.000000   40792.084045
50%    33.500000  31.350000   1.000000   70330.513000
75%    45.500000  34.775000   2.000000   79618.585500
max    64.000000  47.600000   5.000000  105181.658780

In [57]:
import numpy as np
log_charges_count = np.log(data['charges'])

print (log_charges_count.head())

print (log_charges_count.shape)

0    9.734176
1    7.453302
2    8.400538
3    9.998092
4    8.260197
Name: charges, dtype: float64
(1338,)

In [218]:
mean_charges = data['charges'].mean()
print (mean_charges)

26540.844530282513

In [220]:
stars_by_city = data.groupby('sex').mean()
stars_by_city

              age        bmi  children       charges
sex
female  39.503021  30.377749  1.074018  25139.157688
male    38.917160  30.943129  1.115385  27913.502355

In [226]:
stars_by_city_more = data.groupby('region').agg({'charges': {'mean1':'mean', 'std1':'std'}, 'children': 'sum', 'age': 'count'})
stars_by_city_more.head()

D:\Anaconda3\lib\site-packages\pandas\core\groupby.py:4036: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

                charges               children   age
                  mean1          std1      sum count
region
northeast  26812.769033  22511.606131      339   324
northwest  24835.150748  22144.553855      373   325
southeast  29470.822875  27942.197178      382   364
southwest  24693.874755  23114.358201      371   325

In [234]:
data3 = data.sort_values('age',ascending=False, inplace=False).head()
data3.head()

      age     sex     bmi  children smoker     region     charges dummy_col
335    64    male  34.500         0     no  southwest  27645.6060         F
603    64  female  39.050         3     no  southeast  32170.2550         F
752    64    male  37.905         0     no  northwest  28421.0719         F
1265   64    male  23.760         0    yes  southeast  53853.0288         F
534    64    male  40.480         0     no  southeast  27662.2304         F

In [308]:
import numpy as np

In [246]:
from sklearn.linear_model import LinearRegression

In [238]:
?LinearRegression

In [327]:
x= data[['bmi','age','children']]
y= data['charges']

x, y = np.array(x), np.array(y)

In [328]:
print(x)
print(y)

[[ 27.9   19.     0.  ]
 [ 33.77  18.     1.  ]
 [ 33.    28.     3.  ]
 ...,
 [ 36.85  18.     0.  ]
 [ 25.8   21.     0.  ]
 [ 29.07  61.     0.  ]]
[ 33769.848    3451.1046   8898.924  ...,   3259.667    4015.89    58282.7206]

In [329]:
model = LinearRegression().fit(x, y)

In [330]:
model

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [331]:
r_sq = model.score(x, y)

print('coefficient of determination:', r_sq)

print('intercept:', model.intercept_)

print('slope:', model.coef_)


# y - charges
# x - bmi
# b0 - intercept
# b1 - slope
# y = b0 + b1 * x

coefficient of determination: 0.120098195762
intercept: -13832.4866956
slope: [  664.16672901   479.98894859  1085.72930449]

In [322]:
data['bmi'][0]

27.899999999999999

In [323]:
data['charges'][0]

33769.847999999998

In [332]:
y_pred = model.predict(x)

print(y)
print(y_pred)

[ 33769.848    3451.1046   8898.924  ...,   3259.667    4015.89    58282.7206]
[ 13817.55506688  18321.95412205  24781.89383558 ...,  19281.8583429
  13382.78283314  34754.16598048]

In [326]:
y_pred2 = model.intercept_ + np.sum(model.coef_ * x, axis=1)
print(y)
print(y_pred2)

[ 33769.848    3451.1046   8898.924  ...,   3259.667    4015.89    58282.7206]
[ 14923.2124032   18348.36101356  22674.21033173 ...,  20399.42597298
  14492.48213339  36024.5360594 ]

In [339]:
data = data.drop('dummy_col', axis=1)
data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  33769.84800
1   18    male  33.770         1     no  southeast   3451.10460
2   28    male  33.000         3     no  southeast   8898.92400
3   33    male  22.705         0     no  northwest  43968.94122
4   32    male  28.880         0     no  northwest   7733.71040

In [347]:

x2 = pd.get_dummies(data=data, columns=['sex', 'region','smoker'])

x2.head()

,age,bmi,children,charges,sex_female,sex_male,region_northeast,region_northwest,region_southeast,region_southwest,smoker_no,smoker_yes
0,19,27.900,0,33769.84800,1,0,0,0,0,1,0,1
1,18,33.770,1,3451.10460,0,1,0,0,1,0,1,0
2,28,33.000,3,8898.92400,0,1,0,0,1,0,1,0
3,33,22.705,0,43968.94122,0,1,0,1,0,0,1,0
4,32,28.880,0,7733.71040,0,1,0,1,0,0,1,0

In [351]:
x2.head()

,age,bmi,children,sex_female,sex_male,region_northeast,region_northwest,region_southeast,region_southwest,smoker_no,smoker_yes
0,19,27.900,0,1,0,0,0,0,1,0,1
1,18,33.770,1,0,1,0,0,1,0,1,0
2,28,33.000,3,0,1,0,0,1,0,1,0
3,33,22.705,0,0,1,0,1,0,0,1,0
4,32,28.880,0,0,1,0,1,0,0,1,0

In [352]:

y= data['charges']

x, y = np.array(x2), np.array(y)

print(x)

print(y)

[[ 19.    27.9    0.   ...,   1.     0.     1.  ]
 [ 18.    33.77   1.   ...,   0.     1.     0.  ]
 [ 28.    33.     3.   ...,   0.     1.     0.  ]
 ...,
 [ 18.    36.85   0.   ...,   0.     1.     0.  ]
 [ 21.    25.8    0.   ...,   1.     1.     0.  ]
 [ 61.    29.07   0.   ...,   0.     0.     1.  ]]
[ 33769.848    3451.1046   8898.924  ...,   3259.667    4015.89    58282.7206]

In [353]:
model = LinearRegression().fit(x, y)
model

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [354]:
r_sq = model.score(x, y)

print('coefficient of determination:', r_sq)

print('intercept:', model.intercept_)

print('slope:', model.coef_)

coefficient of determination: 0.750913034599
intercept: -1333.87543987
slope: [   513.71270507    678.38690722    951.0010903     131.3143594
   -131.3143594    1174.01847006    468.09067121   -896.02562872
   -746.08351255 -23848.53454191  23848.53454191]

In [355]:
y_pred = model.predict(x2)
print(y)
print(y_pred)

[ 33769.848    3451.1046   8898.924  ...,   3259.667    4015.89    58282.7206]
[ 50587.42605679   6897.20566862  13413.9769814  ...,   8298.26497135
   2493.16987795  74171.24653513]

In [ ]:
import matplotlib as plt